# 4. Data Transformation - 연봉 데이터 다루기
## 4-1. 학습목표: 데이터 변환의 고급 기술을 습득합니다.
1. 데이터를 다양한 방법으로 합치고 변환할 수 있다.
2. 데이터의 스케일을 변환할 수 있다.
3. 카테고리형 데이터를 숫자형태로 변환할 수 있다.
4. 데이터의 차원축소를 할 수 있다.

## 4-2. Data merge(데이터 병합)
1. merge와 join의 특징에 대해 더 알아 봅시다.
2. pandas에서는 merge 함수를 사용하여 SQL 스타일의 조인을 수행할 수 있습니다.

In [1]:
import pandas as pd
import numpy as np

In [2]:
# 병합 실습용 데이터프레임 생성

df_a = pd.DataFrame({'key': ['a', 'b', 'c', 'd', 'e'], 'num_a': [1, 2, 3, 4, 5]})
df_b = pd.DataFrame({'key': ['a', 'b', 'd', 'f', 'g'], 'num_b': [11, 15, 35, 45, 55]})
df_c = pd.DataFrame({'key': ['f', 'g', 'h', 'i', 'j'], 'num_a': [6, 7, 8, 9, 0]})

### 4-2-1.concat() 함수
- pd.concat(axis = int) = 데이터를 int 방향으로 결합; axis 생략시 axis = 0
- 병합할 데이터프레임에 서로 다른 컬럼명이 있을 경우, 컬럼 추가
- 결합방향의 인덱스나 컬럼은 재정렬되지 않고 덧붙여짐에 주목

In [3]:
# axis = 0 혹은 생략의 경우 인덱스는 재정렬되지 않고 이어붙여짐에 주목!
pd.concat([df_a, df_b, df_c])

  key  num_a  num_b
0   a    1.0    NaN
1   b    2.0    NaN
2   c    3.0    NaN
3   d    4.0    NaN
4   e    5.0    NaN
0   a    NaN   11.0
1   b    NaN   15.0
2   d    NaN   35.0
3   f    NaN   45.0
4   g    NaN   55.0
0   f    6.0    NaN
1   g    7.0    NaN
2   h    8.0    NaN
3   i    9.0    NaN
4   j    0.0    NaN

In [4]:
# axis = 1인 경우 컬럼 역시 재정렬이나 병합 없이 이어붙여짐
pd.concat([df_a, df_b, df_c], axis = 1)

  key  num_a key  num_b key  num_a
0   a      1   a     11   f      6
1   b      2   b     15   g      7
2   c      3   d     35   h      8
3   d      4   f     45   i      9
4   e      5   g     55   j      0

### 4-2-2.merge() 함수
- dataframe1.merge(dataframe2) = dataframe1과 dataframe2를 병합
- how 인자를 통해 병합방식을 설정 가능
 - inner join: 머지 대상의 공통된 키만을 추려내 반환
 - left join: "왼쪽" df의 모든 키와 "오른쪽" df의 공통된 키를 반환
 - right join: "오른쪽" df의 모든 키와 "왼쪽" df의 공통된 키를 반환
 - outer join: 머지 대상의 모든 키를 na 포함하여 반환
- on 인자를 통해 병합의 기준이 되는 컬럼을 설정 가능:<br>미설정시 이름이 같은 컬럼들이 기준이 됨

In [5]:
# on 인자를 생략하여, 이름이 같은 "key" 컬럼이 기준이 됨

df_a.merge(df_b, how = 'outer')

  key  num_a  num_b
0   a    1.0   11.0
1   b    2.0   15.0
2   c    3.0    NaN
3   d    4.0   35.0
4   e    5.0    NaN
5   f    NaN   45.0
6   g    NaN   55.0

In [6]:
# 이름이 같은 컬럼이 복수일 경우, 일부만 키 컬럼으로 설정했을 때와 비교

df_a.merge(df_c, how = 'outer') # num_a 컬럼 역시 키 컬럼이며 병합의 대상이 아님

  key  num_a
0   a      1
1   b      2
2   c      3
3   d      4
4   e      5
5   f      6
6   g      7
7   h      8
8   i      9
9   j      0

In [7]:
df_a.merge(df_c, on = 'key', how = 'outer') # num_a 컬럼 역시 병합의 대상이 됨

  key  num_a_x  num_a_y
0   a      1.0      NaN
1   b      2.0      NaN
2   c      3.0      NaN
3   d      4.0      NaN
4   e      5.0      NaN
5   f      NaN      6.0
6   g      NaN      7.0
7   h      NaN      8.0
8   i      NaN      9.0
9   j      NaN      0.0

In [8]:
# "왼쪽"과 "오른쪽"의 df에 공통된 컬럼명이 없을 경우:
# 실습을 위해 df_b의 key 컬럼을 id로 변경한 df_d를 생성

df_d = df_b.rename(columns = {'key': 'id'})

In [9]:
# left_on과 right_on을 각각 지정

df_a.merge(df_d, left_on = "key", right_on = "id", how = "outer")

   key  num_a   id  num_b
0    a    1.0    a   11.0
1    b    2.0    b   15.0
2    c    3.0  NaN    NaN
3    d    4.0    d   35.0
4    e    5.0  NaN    NaN
5  NaN    NaN    f   45.0
6  NaN    NaN    g   55.0

### 4-2-3.join() 함수
- 구문은 merge와 비슷하나 결과는 concat과 비슷
 - 동일한 컬럼명이 있을 경우 에러 발생: 에러 처리 위해 lsuffix, rsuffix 지정 가능
 - 동일한 컬럼명의 내용을 기준으로 병합하고 싶다면 df.set_index('컬럼명')로 처리 필요

In [10]:
# "왼쪽"과 "오른쪽" df에 각각 접미사를 붙여 조인

df_a.join(df_b, lsuffix = "_a", rsuffix = "_b") # how 인자 설정 가능

  key_a  num_a key_b  num_b
0     a      1     a     11
1     b      2     b     15
2     c      3     d     35
3     d      4     f     45
4     e      5     g     55

In [11]:
# 공통된 컬럼명을 가진 key를 인덱스로 처리하여 조인

df_a_join = df_a.set_index('key')
df_b_join = df_b.set_index('key')

df_a_join.join(df_b_join) # how 인자 미설정시 left join이 기본값

     num_a  num_b
key
a        1   11.0
b        2   15.0
c        3    NaN
d        4   35.0
e        5    NaN

### 4-2-4. 연습 데이터를 활용한 예제

In [12]:
#연습용 데이터 호출

salary_1 = pd.read_csv('~/data/salary_1.csv')
salary_2 = pd.read_csv('~/data/salary_2.csv')

In [13]:
# 데이터 확인

salary_1

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior
0,32.0,Male,1,Software Engineer,5.0,90000,UK,White,0
1,28.0,Female,2,Data Analyst,3.0,65000,USA,Hispanic,0
2,45.0,Male,3,Manager,15.0,150000,Canada,White,1
3,36.0,Female,1,Sales Associate,7.0,60000,USA,Hispanic,0
4,52.0,Male,2,Director,20.0,200000,USA,Asian,0
...,...,...,...,...,...,...,...,...,...
3994,44.0,Male,3,Data Scientist,15.0,150000,USA,African American,0
3995,28.0,Male,1,Software Developer,3.0,60000,China,Korean,0
3996,31.0,Male,1,Software Engineer,5.0,80000,UK,Mixed,0
3997,27.0,Female,2,Marketing Manager,3.0,60000,UK,White,0
3998,38.0,Male,3,Data Scientist,12.0,130000,China,Korean,0

In [14]:
salary_2

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior
0,29,Female,1,Human Resources Coordinator,2,45000,China,Chinese,0
1,23,Male,0,Sales Associate,1,25000,USA,Asian,0
2,32,Female,2,Software Developer,7,90000,USA,African American,0
3,44,Male,1,Operations Manager,18,170000,USA,Hispanic,0
4,26,Female,1,Marketing Coordinator,2,40000,Canada,Asian,0
...,...,...,...,...,...,...,...,...,...
2680,49,Female,3,Director of Marketing,20,200000,UK,Mixed,0
2681,32,Male,0,Sales Associate,3,50000,Australia,Australian,0
2682,30,Female,1,Financial Manager,4,55000,China,Chinese,0
2683,46,Male,2,Marketing Manager,14,140000,China,Korean,0
2684,26,Female,0,Sales Executive,1,35000,Canada,Black,0

In [15]:
# 두 데이터프레임 병합

salary_df = pd.concat([salary_1, salary_2])
salary_df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior
0,32.0,Male,1,Software Engineer,5.0,90000,UK,White,0
1,28.0,Female,2,Data Analyst,3.0,65000,USA,Hispanic,0
2,45.0,Male,3,Manager,15.0,150000,Canada,White,1
3,36.0,Female,1,Sales Associate,7.0,60000,USA,Hispanic,0
4,52.0,Male,2,Director,20.0,200000,USA,Asian,0
...,...,...,...,...,...,...,...,...,...
2680,49.0,Female,3,Director of Marketing,20.0,200000,UK,Mixed,0
2681,32.0,Male,0,Sales Associate,3.0,50000,Australia,Australian,0
2682,30.0,Female,1,Financial Manager,4.0,55000,China,Chinese,0
2683,46.0,Male,2,Marketing Manager,14.0,140000,China,Korean,0
2684,26.0,Female,0,Sales Executive,1.0,35000,Canada,Black,0

In [16]:
# 인덱스가 중복되어 있음에 주의

salary_df.loc[0]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior
0,32.0,Male,1,Software Engineer,5.0,90000,UK,White,0
0,29.0,Female,1,Human Resources Coordinator,2.0,45000,China,Chinese,0

In [17]:
# 인덱스를 재설정하는 방법 1

salary_df.reset_index(inplace = True) # index를 재설정하고 기존 index는 컬럼으로 옮김
salary_df # index 컬럼이 새로 생겼음에 주의: drop = True로 해결할 수 있음

,index,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior
0,0,32.0,Male,1,Software Engineer,5.0,90000,UK,White,0
1,1,28.0,Female,2,Data Analyst,3.0,65000,USA,Hispanic,0
2,2,45.0,Male,3,Manager,15.0,150000,Canada,White,1
3,3,36.0,Female,1,Sales Associate,7.0,60000,USA,Hispanic,0
4,4,52.0,Male,2,Director,20.0,200000,USA,Asian,0
...,...,...,...,...,...,...,...,...,...,...
6679,2680,49.0,Female,3,Director of Marketing,20.0,200000,UK,Mixed,0
6680,2681,32.0,Male,0,Sales Associate,3.0,50000,Australia,Australian,0
6681,2682,30.0,Female,1,Financial Manager,4.0,55000,China,Chinese,0
6682,2683,46.0,Male,2,Marketing Manager,14.0,140000,China,Korean,0
6683,2684,26.0,Female,0,Sales Executive,1.0,35000,Canada,Black,0

In [18]:
salary_df.drop('index', axis = 1, inplace = True) # 또는 수동으로 'index' 컬럼 제거
salary_df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior
0,32.0,Male,1,Software Engineer,5.0,90000,UK,White,0
1,28.0,Female,2,Data Analyst,3.0,65000,USA,Hispanic,0
2,45.0,Male,3,Manager,15.0,150000,Canada,White,1
3,36.0,Female,1,Sales Associate,7.0,60000,USA,Hispanic,0
4,52.0,Male,2,Director,20.0,200000,USA,Asian,0
...,...,...,...,...,...,...,...,...,...
6679,49.0,Female,3,Director of Marketing,20.0,200000,UK,Mixed,0
6680,32.0,Male,0,Sales Associate,3.0,50000,Australia,Australian,0
6681,30.0,Female,1,Financial Manager,4.0,55000,China,Chinese,0
6682,46.0,Male,2,Marketing Manager,14.0,140000,China,Korean,0
6683,26.0,Female,0,Sales Executive,1.0,35000,Canada,Black,0

In [19]:
# salary 컬럼을 국가별 소비자물가지수로 환산하기 위해 데이터 호출

cpi = pd.read_csv('~/data/cpi.csv')
cpi

,Country,Reference,Last,Previous,Units,Frequency
0,United States,Sep-23,307.48,306.27,"Index 1982-84=100, SA",Monthly
1,China,Sep-23,100,100.1,"Index CPPY=100, NSA",Monthly
2,Germany,Sep-23,117.9,117.5,"Index 2020=100, CDASA",Monthly
3,France,Sep-23,118.52,118.2,"Index 2015=100, SA",Monthly
4,United Kingdom,Sep-23,132,131.3,"Index 2015=100, NSA",Monthly
5,Brazil,Sep-23,"6,700","6,683","Index Dec1993=100, NSA",Monthly
6,Italy,Aug-23,120.1,119.7,"Index 2015=100, NSA",Monthly
7,Russian Federation,Nov-21,205.5,203.5,"Index 2010=100, NSA",Monthly
8,Canada,Sep-23,158.7,158.4,"Index 2002=100, SA",Monthly
9,Australia,2023 Q3,135.3,133.7,"Index FY 2012=100, NSA",Quarterly
10,Spain,Sep-23,113.35,113.15,"Index 2021=100, NSA",Monthly
11,South Korea,Oct-23,113.37,112.99,"Index 2020=100, NSA",Monthly
12,Mexico,Sep-23,130.12,129.54,"Index 2nd half Jul2018=100, NSA",Monthly
13,Indonesia,Oct-23,115.64,115.44,"Index 2018=100, NSA",Monthly
14,Netherlands,Sep-23,127.16,127.7,"Index 2015=100, NSA",Monthly

In [20]:
# merge의 기준이 될 수 있는 country 값이 각 df에서 다르므로, 전처리를 위해 확인

print(f"salary_df: {salary_df['Country'].unique()}")
print(f"cpi: {cpi['Country'].unique()}")

salary_df: ['UK' 'USA' 'Canada' 'China' 'Australia']
cpi: ['United States' 'China' 'Germany' 'France' 'United Kingdom' 'Brazil'
 'Italy' 'Russian Federation' 'Canada' 'Australia' 'Spain' 'South Korea'
 'Mexico' 'Indonesia' 'Netherlands']

In [21]:
# 병합대상인 cpi의 컬럼값을 확인된 결과에 따라 전처리

cpi['Country'].replace({'United States': 'USA', 'United Kingdom': 'UK'}, inplace = True)

In [22]:
# 'Country' 컬럼을 기준으로 left join

salary_df = salary_df.merge(cpi, on = 'Country', how = 'left')
salary_df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior,Reference,Last,Previous,Units,Frequency
0,32.0,Male,1,Software Engineer,5.0,90000,UK,White,0,Sep-23,132,131.3,"Index 2015=100, NSA",Monthly
1,28.0,Female,2,Data Analyst,3.0,65000,USA,Hispanic,0,Sep-23,307.48,306.27,"Index 1982-84=100, SA",Monthly
2,45.0,Male,3,Manager,15.0,150000,Canada,White,1,Sep-23,158.7,158.4,"Index 2002=100, SA",Monthly
3,36.0,Female,1,Sales Associate,7.0,60000,USA,Hispanic,0,Sep-23,307.48,306.27,"Index 1982-84=100, SA",Monthly
4,52.0,Male,2,Director,20.0,200000,USA,Asian,0,Sep-23,307.48,306.27,"Index 1982-84=100, SA",Monthly
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6679,49.0,Female,3,Director of Marketing,20.0,200000,UK,Mixed,0,Sep-23,132,131.3,"Index 2015=100, NSA",Monthly
6680,32.0,Male,0,Sales Associate,3.0,50000,Australia,Australian,0,2023 Q3,135.3,133.7,"Index FY 2012=100, NSA",Quarterly
6681,30.0,Female,1,Financial Manager,4.0,55000,China,Chinese,0,Sep-23,100,100.1,"Index CPPY=100, NSA",Monthly
6682,46.0,Male,2,Marketing Manager,14.0,140000,China,Korean,0,Sep-23,100,100.1,"Index CPPY=100, NSA",Monthly
6683,26.0,Female,0,Sales Executive,1.0,35000,Canada,Black,0,Sep-23,158.7,158.4,"Index 2002=100, SA",Monthly

In [23]:
# 분석과 무관한 컬럼 삭제

salary_df.drop(['Reference', 'Previous', 'Units', 'Frequency'], axis = 1, inplace = True)
salary_df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior,Last
0,32.0,Male,1,Software Engineer,5.0,90000,UK,White,0,132
1,28.0,Female,2,Data Analyst,3.0,65000,USA,Hispanic,0,307.48
2,45.0,Male,3,Manager,15.0,150000,Canada,White,1,158.7
3,36.0,Female,1,Sales Associate,7.0,60000,USA,Hispanic,0,307.48
4,52.0,Male,2,Director,20.0,200000,USA,Asian,0,307.48
...,...,...,...,...,...,...,...,...,...,...
6679,49.0,Female,3,Director of Marketing,20.0,200000,UK,Mixed,0,132
6680,32.0,Male,0,Sales Associate,3.0,50000,Australia,Australian,0,135.3
6681,30.0,Female,1,Financial Manager,4.0,55000,China,Chinese,0,100
6682,46.0,Male,2,Marketing Manager,14.0,140000,China,Korean,0,100
6683,26.0,Female,0,Sales Executive,1.0,35000,Canada,Black,0,158.7

In [24]:
# 'Last' 컬럼명을 변경

salary_df.rename({'Last': 'CPI'}, axis = 1, inplace = True)
salary_df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior,CPI
0,32.0,Male,1,Software Engineer,5.0,90000,UK,White,0,132
1,28.0,Female,2,Data Analyst,3.0,65000,USA,Hispanic,0,307.48
2,45.0,Male,3,Manager,15.0,150000,Canada,White,1,158.7
3,36.0,Female,1,Sales Associate,7.0,60000,USA,Hispanic,0,307.48
4,52.0,Male,2,Director,20.0,200000,USA,Asian,0,307.48
...,...,...,...,...,...,...,...,...,...,...
6679,49.0,Female,3,Director of Marketing,20.0,200000,UK,Mixed,0,132
6680,32.0,Male,0,Sales Associate,3.0,50000,Australia,Australian,0,135.3
6681,30.0,Female,1,Financial Manager,4.0,55000,China,Chinese,0,100
6682,46.0,Male,2,Marketing Manager,14.0,140000,China,Korean,0,100
6683,26.0,Female,0,Sales Executive,1.0,35000,Canada,Black,0,158.7

## 4-3. 개요/결측치&이상치/집계&그룹화/피벗
1. **Overview** : 데이터의 기본적인 특성을 파악하고, 데이터셋의 구조와 내용을 이해하는 데 도움을 줍니다.
 - **head( )**: 데이터프레임의 **처음 몇 행(기본적으로 5행)을 표시**합니다. **데이터의 포맷, 변수의 형태 등을 빠르게 확인**할 수 있습니다.
 - **tail( )**: 데이터프레임의 **마지막 몇 행을 표시**합니다. **데이터의 전체적인 분포를 확인**하는 데 도움이 됩니다.
 - **describe( )**: **수치형 열에 대한 기술통계**를 제공합니다. **평균, 표준편차, 최소값, 최대값 등을** 확인할 수 있습니다.
 - **info( )**: **데이터프레임의 기본 정보**를 제공합니다. **각 열의 데이터 타입, 누락된 값의 수, 메모리 사용량 등**을 확인할 수 있습니다.
 - **dtypes**: **각 열의 데이터 타입**을 보여줍니다. **데이터 형식을 빠르게 이해**하는 데 유용합니다.

2. **Outlier** : 이상치(Outlier)를 탐지하고 처리하는 데 사용되는 여러 방법과 함수들이 있습니다.
 - **통계적 방법**: Z-점수와 IQR을 사용하여 이상치를 식별할 수 있습니다.
 - **시각적 방법**: 박스 플롯으로 이상치를 시각화하여 이상치를 식별할 수 있습니다.
 - **데이터 필터링**: 조건에 따라 이상치 필터링 및 제거등의 방법으로 이상치를 식별할 수 있습니다.

3. **Aggregation** : 여러 데이터 포인트를 요약하고, 그룹화하여 새로운 통계 또는 정보를 추출하는 과정입니다.
 - **groupby( )**: **데이터를 특정 기준으로 그룹화**하여 집계 연산에 적용할 수 있습니다.
 - 집계 함수: sum( ), mean( ), median( ), min( ), max( ), count( ) 등으로 **각 그룹의 요약 통계**를 제공 합니다.
 - std( ) 함수 : 표준편차는 데이터 세트 내의 값들이 평균으로부터 얼마나 멀리 퍼져 있는지를 측정하는 값으로, **데이터의 분산 정도**를 나타냅니다.
 - agg( ) 함수: **다양한 집계 함수를 한 번에 적용**하여 다양한 요약 통계를 얻을 수 있습니다.

4. **Pivot Table**
 - **데이터프레임을 재구성**하여, 특정 열을 새로운 행과 열의 인덱스로 사용하고, 다른 열의 데이터로 새로운 표를 만드는 데 사용됩니다.

### 4-3-1. 개요

In [25]:
# .info() 함수 사용

salary_df.info() # CPI 컬럼 데이터형이 object임에 유의

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6684 entries, 0 to 6683
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6680 non-null   float64
 1   Gender               6684 non-null   object
 2   Education Level      6684 non-null   int64
 3   Job Title            6684 non-null   object
 4   Years of Experience  6684 non-null   float64
 5   Salary               6684 non-null   int64
 6   Country              6684 non-null   object
 7   Race                 6684 non-null   object
 8   Senior               6684 non-null   int64
 9   CPI                  6684 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 574.4+ KB

### 4-3-2. 결측치 및 이상치 처리

In [26]:
# 숫자로 형변환 불가능한 데이터가 있는지 확인하고, 없다면 형변환

salary_df['CPI'] = pd.to_numeric(salary_df['CPI'])

In [27]:
# .describe() 함수 사용하여 이상치를 간단히 확인

salary_df.describe() #교육수준, 경력년차, 급여 등에 주목

,Age,Education Level,Years of Experience,Salary,Senior,CPI
count,6680.000000,6684.000000,6684.000000,6684.000000,6684.000000,6684.00000
mean,33.611527,1.622382,8.084007,115307.175194,0.143477,167.12953
std,7.595506,0.880474,6.097824,52806.810881,0.350585,73.22657
min,21.000000,0.000000,-1.000000,350.000000,0.000000,100.00000
25%,28.000000,1.000000,3.000000,70000.000000,0.000000,132.00000
50%,32.000000,1.000000,7.000000,115000.000000,0.000000,135.30000
75%,38.000000,2.000000,12.000000,160000.000000,0.000000,158.70000
max,62.000000,3.000000,82.000000,250000.000000,1.000000,307.48000

In [28]:
# 결측치 확인: 절대수량(.sum())과 비율(.mean())

print(salary_df.isna().sum())
print(salary_df.isna().mean())

Age                    4
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
Country                0
Race                   0
Senior                 0
CPI                    0
dtype: int64
Age                    0.000598
Gender                 0.000000
Education Level        0.000000
Job Title              0.000000
Years of Experience    0.000000
Salary                 0.000000
Country                0.000000
Race                   0.000000
Senior                 0.000000
CPI                    0.000000
dtype: float64

In [29]:
# "Age" 컬럼에 결측값이 있으므로 해당 엔트리 확인

salary_df[salary_df['Age'].isna()] # 결측치 엔트리간의 동질성이 매우 낮으므로 드랍

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior,CPI
548,NaN,Male,1,Data Analyst,3.0,130000,Canada,White,0,158.70
2135,NaN,Female,3,Project Engineer,16.0,190000,USA,African American,1,307.48
2749,NaN,Female,1,Software Engineer,1.0,50000,Australia,White,0,135.30
3826,NaN,Female,2,Marketing Coordinator,8.0,85000,UK,Asian,0,132.00

In [30]:
# "Years of Experience" 컬럼에 특이값이 있으므로 확인

salary_df['Years of Experience'].sort_values() # 경력년차를 정렬하여 확인

256     -1.0
102     -1.0
359     -1.0
5942     0.0
5613     0.0
        ...
2471    33.0
2466    33.0
2490    34.0
2415    34.0
564     82.0
Name: Years of Experience, Length: 6684, dtype: float64

In [31]:
print(salary_df[salary_df['Years of Experience'] < 0]) # 경력을 추정하기 힘들어 드랍
print(salary_df[salary_df['Years of Experience'] > salary_df['Age'] - 18]) # 경력이 나이보다 많으므로 드랍

      Age  Gender  Education Level               Job Title  \
102  49.0  Female                2              HR Manager
256  35.0    Male                1     Project Coordinator
359  34.0    Male                1  Operations Coordinator

     Years of Experience  Salary    Country     Race  Senior    CPI
102                 -1.0  150000  Australia    White       1  135.3
256                 -1.0   95000         UK    Asian       1  132.0
359                 -1.0   90000      China  Chinese       1  100.0
       Age  Gender  Education Level                  Job Title  \
564   25.0  Female                1               Data Analyst
2373  25.0    Male                3  Software Engineer Manager
2448  25.0    Male                3  Software Engineer Manager

      Years of Experience  Salary    Country     Race  Senior    CPI
564                  82.0  110000  Australia    White       0  135.3
2373                 12.0  169159      China  Chinese       0  100.0
2448                 12.0  169159      China    White       0  100.0

In [32]:
# 위에서 확인한 기준대로 결측치 및 이상치 정리

salary_df.dropna(inplace = True)
salary_df = salary_df[salary_df['Years of Experience'] >= 0]
salary_df = salary_df[salary_df['Years of Experience'] < salary_df['Age'] - 18]

salary_df.describe()

,Age,Education Level,Years of Experience,Salary,Senior,CPI
count,6674.000000,6674.000000,6674.000000,6674.000000,6674.000000,6674.000000
mean,33.612826,1.622116,8.076491,115294.402307,0.143093,167.164774
std,7.594369,0.880460,6.029750,52819.326323,0.350193,73.241730
min,21.000000,0.000000,0.000000,350.000000,0.000000,100.000000
25%,28.000000,1.000000,3.000000,70000.000000,0.000000,132.000000
50%,32.000000,1.000000,7.000000,115000.000000,0.000000,135.300000
75%,38.000000,2.000000,12.000000,160000.000000,0.000000,158.700000
max,62.000000,3.000000,34.000000,250000.000000,1.000000,307.480000

### 4-3-3. 데이터 그룹화

In [33]:
# 데이터 그룹화 실습을 위해 데이터프레임 확인

salary_df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary,Country,Race,Senior,CPI
0,32.0,Male,1,Software Engineer,5.0,90000,UK,White,0,132.00
1,28.0,Female,2,Data Analyst,3.0,65000,USA,Hispanic,0,307.48
2,45.0,Male,3,Manager,15.0,150000,Canada,White,1,158.70
3,36.0,Female,1,Sales Associate,7.0,60000,USA,Hispanic,0,307.48
4,52.0,Male,2,Director,20.0,200000,USA,Asian,0,307.48

In [34]:
# 데이터프레임을 성별 컬럼값을 기준으로 그룹화하여 평균치 확인

salary_df.groupby('Gender').mean()

,Age,Education Level,Years of Experience,Salary,Senior,CPI
Gender,,,,,,
Female,32.622008,1.600066,7.417221,107873.854056,0.127992,167.485166
Male,34.425805,1.640207,8.617430,121383.057283,0.155483,166.901888

In [35]:
# 특정 컬럼의 값 확인

salary_df.groupby('Gender')['Salary'].describe()

,count,mean,std,min,25%,50%,75%,max
Gender,,,,,,,,
Female,3008.0,107873.854056,52728.350439,500.0,60000.0,105000.0,150000.0,220000.0
Male,3666.0,121383.057283,52117.611899,350.0,75000.0,120000.0,170000.0,250000.0

In [36]:
# 복수의 컬럼값을 기준으로 그룹화하여 평균치 확인
#
# 주의! 그룹화의 기준인 Gender와 Country 컬럼은 "인덱스"가 됨
# 이를 컬럼으로 되돌리기 위해선 .reset_index()를 사용할 수 있음

salary_df.groupby(['Gender', 'Country']).mean() # 여러 인자를 동시에 줄 때에는 리스트인 점 주의!

                        Age  Education Level  Years of Experience  \
Gender Country
Female Australia  32.443535         1.582651             7.288871
       Canada     32.458763         1.554983             7.212199
       China      33.370558         1.641286             7.985618
       UK         32.771382         1.626645             7.575658
       USA        32.087662         1.594156             7.036526
Male   Australia  34.388350         1.624133             8.493065
       Canada     34.660352         1.679296             8.878214
       China      34.273826         1.614765             8.447651
       UK         34.634349         1.691136             8.795014
       USA        34.177267         1.592693             8.475643

                         Salary    Senior     CPI
Gender Country
Female Australia  107936.054010  0.129296  135.30
       Canada     106884.711340  0.132302  158.70
       China      111291.211506  0.147208  100.00
       UK         108495.273026  0.118421  132.00
       USA        104854.691558  0.113636  307.48
Male   Australia  120896.764216  0.147018  135.30
       Canada     123973.921516  0.167794  158.70
       China      120135.522148  0.158389  100.00
       UK         122244.048476  0.162050  132.00
       USA        119683.120433  0.142084  307.48

In [37]:
#복수의 통계치를 결합하여 확인

salary_df.groupby('Gender')['Salary'].agg(['sum', 'mean', 'std']) # 여러 인자를 동시에 줄 때에는 리스트인 점 주의!

              sum           mean           std
Gender
Female  324484553  107873.854056  52728.350439
Male    444990288  121383.057283  52117.611899

### 4-3-4. 피벗
- 기존 테이블의 자료를 이용하되 열과 행을 재정의하는 기능
 - 피벗테이블: 각 열과 행에 해당하는 셀에 복수의 값이 지정될 경우, 대표값 표시
 - 피벗: 대표값을 표시하지 않고 복수의 값을 표시

In [38]:
# 성별을 인덱스로, 국가를 컬럼으로 삼아 급여를 보여주는 피벗 테이블 생성
# 기본값은 평균을 보여주나, aggfunc 인자를 사용하여 다른 통계치 지정 가능

pd.pivot_table(salary_df, index = "Gender", columns = "Country", values = "Salary")

Country,Australia,Canada,China,UK,USA
Gender,,,,,
Female,107936.054010,106884.711340,111291.211506,108495.273026,104854.691558
Male,120896.764216,123973.921516,120135.522148,122244.048476,119683.120433

In [39]:
# 표준편차를 보여주는 피벗 테이블 생성

pd.pivot_table(salary_df, index = "Gender", columns = "Country", values = "Salary", aggfunc = "std")

Country     Australia        Canada         China            UK           USA
Gender
Female   54148.406493  54038.404647  52639.020111  52131.055279  50644.548637
Male     52984.560872  51820.561374  50771.049492  53092.025716  51964.604996

In [40]:
# 피벗 펑션 연습을 위한 데이터프레임 예제 작성

sales_df = pd.DataFrame({'company': ['a', 'a', 'a', 'a', 'b', 'b', 'b', 'b'],
             'quarter': ['q1', 'q2', 'q3', 'q4', 'q1', 'q2', 'q3', 'q4'],
             'sales' : [111, 222, 333, 444, 555, 666, 777, 888]})

sales_df

  company quarter  sales
0       a      q1    111
1       a      q2    222
2       a      q3    333
3       a      q4    444
4       b      q1    555
5       b      q2    666
6       b      q3    777
7       b      q4    888

In [41]:
sales_pivot = pd.pivot(sales_df, index = 'company', columns = 'quarter', values = 'sales')
sales_pivot

quarter   q1   q2   q3   q4
company
a        111  222  333  444
b        555  666  777  888

In [42]:
print(sales_df.columns)
print(sales_pivot.columns) # pivot 컬럼들의 'name'이 'quartuer'가 되는 것에 주목

Index(['company', 'quarter', 'sales'], dtype='object')
Index(['q1', 'q2', 'q3', 'q4'], dtype='object', name='quarter')

In [43]:
sales_pivot.reset_index() # index에 quarter 이름이 보기싫게 붙은 이유 ↑

quarter company   q1   q2   q3   q4
0             a  111  222  333  444
1             b  555  666  777  888

In [44]:
sales_pivot.index

Index(['a', 'b'], dtype='object', name='company')

In [45]:
sales_pivot.columns = sales_pivot.columns.rename('') # 컬럼명 삭제
new_df = sales_pivot.reset_index() 
new_df

  company   q1   q2   q3   q4
0       a  111  222  333  444
1       b  555  666  777  888

In [46]:
# 피벗을 데이터테이블로 재구성하기

pd.melt(new_df, id_vars = 'company', value_vars = ['q1', 'q2', 'q3', 'q4'], var_name = 'quarter', value_name = 'sales').sort_values('company')

  company quarter  sales
0       a      q1    111
2       a      q2    222
4       a      q3    333
6       a      q4    444
1       b      q1    555
3       b      q2    666
5       b      q3    777
7       b      q4    888